src/main/java/com/amdocs/halo/automation/xmls/manageOrderRequestAVPNSL_NS_OA.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <manageOrderRequest xmlns="http://cio.att.com/order/management/model" xmlns:ns0="http://cio.att.com/ord/model" xmlns:ns2="http://cio.att.com/entity/model" xmlns:ns1="http://cio.att.com/req/model">
         <order>
            <ns1:eid>
               <ns2:context>OCX</ns2:context>
               <ns2:id>{$oaId$}</ns2:id>
               <ns2:entityType>OrderAction</ns2:entityType>
            </ns1:eid>
            <ns1:type>AVPNSL</ns1:type>
            <ns1:characteristics>
               <ns2:item>
                  <ns2:name>ServiceGroupOrderId</ns2:name>
                  <ns2:value>{$sgId$}</ns2:value>
               </ns2:item>
               <ns2:item>
                  <ns2:name>portService</ns2:name>
                  <ns2:value>Private Line</ns2:value>
               </ns2:item>
               <ns2:item>
                  <ns2:name>newVPN</ns2:name>
                  <ns2:value>false</ns2:value>
               </ns2:item>
               <ns2:item>
                  <ns2:name>billerCode</ns2:name>
                  <ns2:value>UP</ns2:value>
               </ns2:item>
               <ns2:item>
                  <ns2:name>billingPlatform</ns2:name>
                  <ns2:value>UB</ns2:value>
               </ns2:item>
               <ns2:item>
                  <ns2:name>circuitType</ns2:name>
                  <ns2:value>40 Gbps</ns2:value>
               </ns2:item>
               <ns2:item>
                  <ns2:name>isHybridNetwork</ns2:name>
                  <ns2:value>false</ns2:value>
               </ns2:item>
               <ns2:item>
                  <ns2:name>SORID</ns2:name>
                  <ns2:value>{$sorId$}</ns2:value>
               </ns2:item>
            </ns1:characteristics>
            <ns1:associations>
               <ns2:item>
                  <ns2:associationName>AssociatedSiteOrder</ns2:associationName>
                  <ns2:items>
                     <ns2:item>
                        <ns2:context>OCX</ns2:context>
                        <ns2:id>{$sgId$}</ns2:id>
                        <ns2:entityType>Order</ns2:entityType>
                     </ns2:item>
                  </ns2:items>
               </ns2:item>
            </ns1:associations>
            <ns0:isBundle>false</ns0:isBundle>
            <ns0:actionType>PR</ns0:actionType>
            <ns0:actionSubType>NA</ns0:actionSubType>
            <ns0:version>1</ns0:version>
            <ns0:reasonsList/>
         </order>
      </manageOrderRequest>
   </soapenv:Body>
</soapenv:Envelope>